Revit 2020 API
AdvancedWood.WoodGrowthPerlinEnable Property
 The property labeled "Use perlin noise for ring growth" from the "PrismWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static string WoodGrowthPerlinEnable { get; }
Visual Basic
Public Shared ReadOnly Property WoodGrowthPerlinEnable As String
	Get
Visual C++
public:
static property String^ WoodGrowthPerlinEnable {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace